import "../Privacypolicy/Privacypolicy.css";

const Privacypolicy = () => {
  return (
    <div className="container  privacypolicy-wapper">
      <h2 className="privacy-txt">隱私保護</h2>
      <hr />
      <p>
        本網站尊重並保護所有使用服務用戶的個人隱私權。為了給您提供更準確、更有個性化的服務，本網站會按照本隱私權政策的規定使用和披露您的個人信息。但本網站將以高度的勤勉、審慎義務對待這些信息。除本隱私權政策另有規定外，在未征
        【原文鏈接：https://sto55.com/webbook/privacypolicy.html】
        得您事先許可的情況下，本網站不會將這些信息對外披露或向第三方提供。本網站會不時更新本隱私權政策。您在同意本網站服務使用協議之時，即視為您已經同意本隱私權政策全部內容。本隱私權政策屬於本網站服務使用協議不可分割的一部分。
      </p>
      <br />
      <h4>一、適用範圍</h4>
      <p>
        (a)在您註冊本網站帳號時，您根據本網站要求提供的個人註冊信息；
          (b)在您使用本網站網絡服務，或訪問本網站平臺網頁時，本網站自動接收並記錄的您的瀏覽器和計算機上的信息，包括但不限於您的IP地址、瀏覽器的類型、使用的語言、訪問日期和時間、軟硬件特征信息及您需求的網頁記錄等數據；
          (c)本網站通過合法途徑從商
        【原文鏈接：https://sto55.com/webbook/privacypolicy.html】
        業夥伴處取得的用戶個人數據。
          您了解並同意，以下信息不適用本隱私權政策：
          (a)您在使用本網站平臺提供的搜索服務時輸入的關鍵字信息；
          (b)本網站收集到的您在本網站發布的有關信息數據，包括但不限於參與活動、文章發布信息及評論詳情；
          (c)違反法律規定或違反本網站規則行為及本網站已對您采取的措施。
      </p>
      <br />
      <h4>二、信息使用</h4>
      <p>
         (a)本網站不會向任何無關第三方提供、出售、出租、分享或交易您的個人信息，除非事先得到您的許可，或該第三方和本網站（含本網站關聯公司）單獨或共同為您提供服務，且在該服務結束後，其將被禁止訪問包括其以前能夠訪問的所有這些資料。
          (b)本網站亦不允許任何第三方以任何手段收集、編輯、出售或者無償傳播您的
        【原文鏈接：https://sto55.com/webbook/privacypolicy.html】
        個人信息。任何本網站平臺用戶如從事上述活動，一經發現，本網站有權立即終止與該用戶的服務協議。
          (c)為服務用戶的目的，本網站可能通過使用您的個人信息，向您提供您感興趣的信息，包括但不限於向您發出產品和服務信息，或者與本網站合作夥伴共享信息以便他們向您發送有關其產品和服務的信息（後者需要您的事先同意）。
      </p>
      <br />
      <h4>三、信息披露</h4>
      <p>
          在如下情況下，本網站將依據您的個人意願或法律的規定全部或部分的披露您的個人信息：
          (a)經您事先同意，向第三方披露；
          (b)為提供您所要求的產品和服務，而必須和第三方分享您的個人信息；
          (c)根據法律的有關規定，或者行政或司法機構的要求，向第三方或者行政、司法機構披露
        【原文鏈接：https://sto55.com/webbook/privacypolicy.html】 ；
          (誒)如您出現違反您所在國家或地區有關法律、法規或者本網站服務協議或相關規則的情況，需要向第三方披露；
          (e)如您是適格的知識產權投訴人並已提起投訴，應被投訴人要求，向被投訴人披露，以便雙方處理可能的權利糾紛；
          (f)其它本網站根據法律、法規或者網站政策認為合適的披露。
      </p>
      <br />
      <h4>四、信息存儲和交換</h4>
      <p>
          (a)本網站帳號均有安全保護功能，請妥善保管您的用戶名及密碼信息。本網站將通過對用戶密碼進行加密等安全措施確保您的信息不丟失，不被濫用和變造。盡管有前述安全措施，但同時也請您註
        【原文鏈接：https://sto55.com/webbook/privacypolicy.html】
        意在信息網絡上不存在「完善的安全措施」。
          (b)本網站客戶端與服務器之間采用HTTPS加密傳輸方式，以盡可能避免用戶數據在網路傳輸過程中受到監聽、篡改等破壞信息安全的行為。
      </p>
      <br />
      <h4>五、信息安全</h4>
      <p>
          (a)本網站帳號均有安全保護功能，請妥善保管您的用戶名及密碼信息。本網站將通過對用戶密碼進行加密等安全措施確保您的信息不丟失，不被濫用和變造。盡管有前述安全措施，但同時也請您註意在信息網絡上不存在「完善的安全措施」。
        (b)本網站客戶端與服務器之間采用HTTPS加密傳輸方式，以盡可能避免用戶數據在網路傳輸過程中受到監聽、篡改等破壞信息安全的行為。
      </p>
    </div>
  );
};
export default Privacypolicy;
